app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    when 'director'
      ordering,@director_header = {:order => :director}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "release_date" = '1993-11-25 00:00:00.000000', "updated_at" = '2016-04-01 21:22:55.994996' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL LIMIT 1
---
  def similar_movies
    temp_movie = Movie.find(params[:movie_id])
    if temp_movie.director.blank?